#!/usr/bin/env python
# -*- coding:utf-8 -*-

# Author:
# @Time    :2019/7/7  21:34

# 集合, 赋值操作, 深浅拷贝
'''

1.判断一个数是否是水仙花数,水仙花数是一个三位数,三位数的每一位的三次方的和还等于这个数，邢这个数就是一个水仙花数,
例如: 153= 1**3+5**3+3**3。

2.给出一个纯数字列表请对列表进行排序(升级题)。
思路:。
1.完成a和b的数据交换.例如,a=10,b=24交换之后,a=24,b= 10
2.循环列表判断a[j]和a[i+1]之间的大小关系如果aj比a[i+1]大. 则进行互换.循环结束的时候.当前列表中最大的数据就会被移动到最右端.。
3.如果再次执行一次上面的操作.最终第二大的数据就移动到了右端.以此类推.如果反复的进行执行相应的操作.那这个列表就变成了一个有序列表。

3.完成彩票36选7的功能从36个数中随机的产生7个数.最终获取到7个不重复的数据作为最终的开奖结果,。
随机数:。
from random import randinte
randint(0, 20)#0-20的随机数。

4.税务部门征收所得税规定如下: 
    1).收入在2000以下的.免征。
    2).收入在2000-4000的，超过2000部分要征收3%的税。
    3).收入在4000-6000的，超过4000部分要征收5%的税。
    4).收入在6000-10000的，超过6000部分要征收8%的税
    4).收入在10000以上的，超过部分征收20%的税。
注，如果一个人的收入是8000,那么他要交2000到4000的税加上4000到6000的税加上6000到8000的税.
收入= 8000- (4000-2000) *3%- (6000-4000) *4%- (8000-6000)*8%。让用户输入它的工资,计算最終用户拿到手是多少钱。
'''


def func():
    # inp_num = int(input("输入数字：").strip())
    # th = inp_num//100
    # hu = inp_num%100//10
    # un = inp_num%10
    # if inp_num == th**3+hu**3+un**3:
    #     print(True)
    # else:
    #     print(False)
    # print("----------------end question1----------------")

    from random import randint
    li2 = []
    for i in range(0, 10):
        li2.append(randint(0, 20))
    print(li2)
    tmp = 0
    for i in range(0, len(li2)-1):
        tmp = li2[i]
        for j in range(i+1, len(li2)):
            if tmp > li2[j]:
                tmp, li2[j] = li2[j], tmp
        li2[i] = tmp
    print(li2)
    print("----------------end question2----------------")

    se3 = set()
    while True:
        se3.add(randint(1, 36))
        if len(se3) == 7:
            break
    print(se3)
    print("----------------end question3----------------")
    num_4 = int(input("月收入：").strip())
    rev = 0
    if num_4 <=2000:
        rev = 0
    elif 2000 < num_4 <= 4000:
        rev = (num_4-2000) * 0.03
    elif 4000 < num_4 <= 6000:
        rev = 2000 * 0.03 + (num_4 - 4000) * 0.05
    elif 6000 < num_4 <= 10000:
        rev = 2000 * 0.03 + 2000 * 0.05 + (num_4 - 6000) * 0.08
    elif num_4 > 10000:
        rev = 2000 * 0.03 + 2000 * 0.05 + 4000 * 0.08 + (num_4 - 10000) * 0.2
    print(rev)
    print("----------------end question4----------------")


if __name__ == "__main__":
    func()
