#####################################################

#  Created by Design Compiler write_sdc on Sun Apr  5 23:34:38 2009

#####################################################
set sdc_version 1.3

create_clock -name "CLK" -period 1.5 -waveform {0 0.75} [get_ports {clk}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[0]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[0]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[1]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[1]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[2]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[2]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[3]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[3]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[4]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[4]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[5]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[5]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[6]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[6]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[7]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[7]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[8]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[8]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[9]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[9]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[10]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[10]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[11]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[11]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[12]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[12]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[13]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[13]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[14]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[14]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[15]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[15]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[16]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[16]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[17]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[17]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[18]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[18]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[19]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[19]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[20]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[20]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[21]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[21]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[22]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[22]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[23]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[23]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[24]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[24]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[25]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[25]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[26]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[26]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[27]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[27]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[28]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[28]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[29]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[29]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[30]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[30]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[31]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[31]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[32]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[32]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[33]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[33]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[34]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[34]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[35]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[35]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[36]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[36]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[37]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[37]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[38]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[38]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[39]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[39]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[40]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[40]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[41]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[41]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[42]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[42]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[43]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[43]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[44]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[44]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[45]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[45]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[46]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[46]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[47]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[47]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[48]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[48]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[49]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[49]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[50]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[50]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[51]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[51]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[52]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[52]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[53]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[53]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[54]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[54]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[55]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[55]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[56]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[56]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[57]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[57]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[58]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[58]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[59]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[59]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[60]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[60]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[61]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[61]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[62]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[62]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {b[63]}]
set_input_delay 0 -min -clock "CLK" [get_ports {b[63]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[0]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[0]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[1]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[1]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[2]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[2]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[3]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[3]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[4]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[4]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[5]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[5]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[6]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[6]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[7]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[7]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[8]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[8]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[9]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[9]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[10]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[10]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[11]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[11]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[12]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[12]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[13]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[13]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[14]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[14]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[15]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[15]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[16]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[16]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[17]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[17]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[18]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[18]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[19]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[19]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[20]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[20]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[21]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[21]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[22]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[22]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[23]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[23]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[24]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[24]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[25]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[25]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[26]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[26]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[27]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[27]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[28]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[28]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[29]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[29]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[30]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[30]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[31]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[31]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[32]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[32]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[33]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[33]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[34]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[34]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[35]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[35]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[36]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[36]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[37]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[37]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[38]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[38]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[39]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[39]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[40]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[40]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[41]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[41]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[42]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[42]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[43]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[43]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[44]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[44]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[45]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[45]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[46]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[46]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[47]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[47]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[48]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[48]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[49]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[49]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[50]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[50]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[51]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[51]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[52]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[52]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[53]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[53]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[54]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[54]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[55]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[55]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[56]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[56]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[57]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[57]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[58]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[58]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[59]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[59]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[60]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[60]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[61]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[61]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[62]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[62]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {a[63]}]
set_input_delay 0 -min -clock "CLK" [get_ports {a[63]}]
set_input_delay 0.45 -max -clock "CLK" [get_ports {rst_n}]
set_input_delay 0 -min -clock "CLK" [get_ports {rst_n}]
set_output_delay 0.45 [get_ports {s[0]}]
set_output_delay 0.45 [get_ports {s[1]}]
set_output_delay 0.45 [get_ports {s[2]}]
set_output_delay 0.45 [get_ports {s[3]}]
set_output_delay 0.45 [get_ports {s[4]}]
set_output_delay 0.45 [get_ports {s[5]}]
set_output_delay 0.45 [get_ports {s[6]}]
set_output_delay 0.45 [get_ports {s[7]}]
set_output_delay 0.45 [get_ports {s[8]}]
set_output_delay 0.45 [get_ports {s[9]}]
set_output_delay 0.45 [get_ports {s[10]}]
set_output_delay 0.45 [get_ports {s[11]}]
set_output_delay 0.45 [get_ports {s[12]}]
set_output_delay 0.45 [get_ports {s[13]}]
set_output_delay 0.45 [get_ports {s[14]}]
set_output_delay 0.45 [get_ports {s[15]}]
set_output_delay 0.45 [get_ports {s[16]}]
set_output_delay 0.45 [get_ports {s[17]}]
set_output_delay 0.45 [get_ports {s[18]}]
set_output_delay 0.45 [get_ports {s[19]}]
set_output_delay 0.45 [get_ports {s[20]}]
set_output_delay 0.45 [get_ports {s[21]}]
set_output_delay 0.45 [get_ports {s[22]}]
set_output_delay 0.45 [get_ports {s[23]}]
set_output_delay 0.45 [get_ports {s[24]}]
set_output_delay 0.45 [get_ports {s[25]}]
set_output_delay 0.45 [get_ports {s[26]}]
set_output_delay 0.45 [get_ports {s[27]}]
set_output_delay 0.45 [get_ports {s[28]}]
set_output_delay 0.45 [get_ports {s[29]}]
set_output_delay 0.45 [get_ports {s[30]}]
set_output_delay 0.45 [get_ports {s[31]}]
set_output_delay 0.45 [get_ports {s[32]}]
set_output_delay 0.45 [get_ports {s[33]}]
set_output_delay 0.45 [get_ports {s[34]}]
set_output_delay 0.45 [get_ports {s[35]}]
set_output_delay 0.45 [get_ports {s[36]}]
set_output_delay 0.45 [get_ports {s[37]}]
set_output_delay 0.45 [get_ports {s[38]}]
set_output_delay 0.45 [get_ports {s[39]}]
set_output_delay 0.45 [get_ports {s[40]}]
set_output_delay 0.45 [get_ports {s[41]}]
set_output_delay 0.45 [get_ports {s[42]}]
set_output_delay 0.45 [get_ports {s[43]}]
set_output_delay 0.45 [get_ports {s[44]}]
set_output_delay 0.45 [get_ports {s[45]}]
set_output_delay 0.45 [get_ports {s[46]}]
set_output_delay 0.45 [get_ports {s[47]}]
set_output_delay 0.45 [get_ports {s[48]}]
set_output_delay 0.45 [get_ports {s[49]}]
set_output_delay 0.45 [get_ports {s[50]}]
set_output_delay 0.45 [get_ports {s[51]}]
set_output_delay 0.45 [get_ports {s[52]}]
set_output_delay 0.45 [get_ports {s[53]}]
set_output_delay 0.45 [get_ports {s[54]}]
set_output_delay 0.45 [get_ports {s[55]}]
set_output_delay 0.45 [get_ports {s[56]}]
set_output_delay 0.45 [get_ports {s[57]}]
set_output_delay 0.45 [get_ports {s[58]}]
set_output_delay 0.45 [get_ports {s[59]}]
set_output_delay 0.45 [get_ports {s[60]}]
set_output_delay 0.45 [get_ports {s[61]}]
set_output_delay 0.45 [get_ports {s[62]}]
set_output_delay 0.45 [get_ports {s[63]}]
set_clock_uncertainty  0.2 -setup [get_clocks {CLK}]
set_clock_uncertainty  0.1 -hold [get_clocks {CLK}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[63]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[63]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[24]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[24]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[16]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[16]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[55]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[55]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[13]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[13]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[58]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[58]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[12]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[12]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[59]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[59]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[32]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[32]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[33]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[33]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[31]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[31]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[34]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[34]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[30]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[30]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[35]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[35]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[29]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[29]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[36]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[36]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[28]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[28]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[37]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[37]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[27]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[27]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[38]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[38]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[26]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[26]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[39]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[39]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[25]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[25]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[40]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[40]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[23]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[23]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[41]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[41]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[22]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[22]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[42]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[42]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[21]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[21]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[43]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[43]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[20]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[20]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[44]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[44]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[19]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[19]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[45]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[45]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[18]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[18]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[46]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[46]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[17]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[17]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[47]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[47]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[15]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[15]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[48]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[48]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[14]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[14]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[49]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[49]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[11]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[11]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[50]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[50]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[10]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[10]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[51]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[51]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[9]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[9]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[52]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[52]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[8]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[8]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[53]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[53]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[7]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[7]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[54]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[54]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[6]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[6]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[56]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[56]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[5]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[5]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[57]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[57]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[4]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[4]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[60]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[60]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[3]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[3]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[61]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[61]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[2]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[2]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[62]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[62]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[1]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[1]/D}]
set_multicycle_path 8 -setup -to [get_pins {s_reg[0]/D}]
set_multicycle_path 8 -hold -to [get_pins {s_reg[0]/D}]
set_max_transition 0.075 [current_design]
set_max_area 0
set_operating_conditions "TCCOM" -library "fsa0a_c_sc_tc"
set_wire_load_model  -name "G5K" -library "fsa0a_c_sc_tc"
set_wire_load_mode "top" 
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {rst_n}]
set_max_fanout 8 [get_ports {rst_n}]
set_max_transition 0.075 [get_ports {rst_n}]
set_max_capacitance 0.020376 [get_ports {rst_n}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[63]}]
set_max_fanout 8 [get_ports {a[63]}]
set_max_transition 0.075 [get_ports {a[63]}]
set_max_capacitance 0.020376 [get_ports {a[63]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[62]}]
set_max_fanout 8 [get_ports {a[62]}]
set_max_transition 0.075 [get_ports {a[62]}]
set_max_capacitance 0.020376 [get_ports {a[62]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[61]}]
set_max_fanout 8 [get_ports {a[61]}]
set_max_transition 0.075 [get_ports {a[61]}]
set_max_capacitance 0.020376 [get_ports {a[61]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[60]}]
set_max_fanout 8 [get_ports {a[60]}]
set_max_transition 0.075 [get_ports {a[60]}]
set_max_capacitance 0.020376 [get_ports {a[60]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[59]}]
set_max_fanout 8 [get_ports {a[59]}]
set_max_transition 0.075 [get_ports {a[59]}]
set_max_capacitance 0.020376 [get_ports {a[59]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[58]}]
set_max_fanout 8 [get_ports {a[58]}]
set_max_transition 0.075 [get_ports {a[58]}]
set_max_capacitance 0.020376 [get_ports {a[58]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[57]}]
set_max_fanout 8 [get_ports {a[57]}]
set_max_transition 0.075 [get_ports {a[57]}]
set_max_capacitance 0.020376 [get_ports {a[57]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[56]}]
set_max_fanout 8 [get_ports {a[56]}]
set_max_transition 0.075 [get_ports {a[56]}]
set_max_capacitance 0.020376 [get_ports {a[56]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[55]}]
set_max_fanout 8 [get_ports {a[55]}]
set_max_transition 0.075 [get_ports {a[55]}]
set_max_capacitance 0.020376 [get_ports {a[55]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[54]}]
set_max_fanout 8 [get_ports {a[54]}]
set_max_transition 0.075 [get_ports {a[54]}]
set_max_capacitance 0.020376 [get_ports {a[54]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[53]}]
set_max_fanout 8 [get_ports {a[53]}]
set_max_transition 0.075 [get_ports {a[53]}]
set_max_capacitance 0.020376 [get_ports {a[53]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[52]}]
set_max_fanout 8 [get_ports {a[52]}]
set_max_transition 0.075 [get_ports {a[52]}]
set_max_capacitance 0.020376 [get_ports {a[52]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[51]}]
set_max_fanout 8 [get_ports {a[51]}]
set_max_transition 0.075 [get_ports {a[51]}]
set_max_capacitance 0.020376 [get_ports {a[51]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[50]}]
set_max_fanout 8 [get_ports {a[50]}]
set_max_transition 0.075 [get_ports {a[50]}]
set_max_capacitance 0.020376 [get_ports {a[50]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[49]}]
set_max_fanout 8 [get_ports {a[49]}]
set_max_transition 0.075 [get_ports {a[49]}]
set_max_capacitance 0.020376 [get_ports {a[49]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[48]}]
set_max_fanout 8 [get_ports {a[48]}]
set_max_transition 0.075 [get_ports {a[48]}]
set_max_capacitance 0.020376 [get_ports {a[48]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[47]}]
set_max_fanout 8 [get_ports {a[47]}]
set_max_transition 0.075 [get_ports {a[47]}]
set_max_capacitance 0.020376 [get_ports {a[47]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[46]}]
set_max_fanout 8 [get_ports {a[46]}]
set_max_transition 0.075 [get_ports {a[46]}]
set_max_capacitance 0.020376 [get_ports {a[46]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[45]}]
set_max_fanout 8 [get_ports {a[45]}]
set_max_transition 0.075 [get_ports {a[45]}]
set_max_capacitance 0.020376 [get_ports {a[45]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[44]}]
set_max_fanout 8 [get_ports {a[44]}]
set_max_transition 0.075 [get_ports {a[44]}]
set_max_capacitance 0.020376 [get_ports {a[44]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[43]}]
set_max_fanout 8 [get_ports {a[43]}]
set_max_transition 0.075 [get_ports {a[43]}]
set_max_capacitance 0.020376 [get_ports {a[43]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[42]}]
set_max_fanout 8 [get_ports {a[42]}]
set_max_transition 0.075 [get_ports {a[42]}]
set_max_capacitance 0.020376 [get_ports {a[42]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[41]}]
set_max_fanout 8 [get_ports {a[41]}]
set_max_transition 0.075 [get_ports {a[41]}]
set_max_capacitance 0.020376 [get_ports {a[41]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[40]}]
set_max_fanout 8 [get_ports {a[40]}]
set_max_transition 0.075 [get_ports {a[40]}]
set_max_capacitance 0.020376 [get_ports {a[40]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[39]}]
set_max_fanout 8 [get_ports {a[39]}]
set_max_transition 0.075 [get_ports {a[39]}]
set_max_capacitance 0.020376 [get_ports {a[39]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[38]}]
set_max_fanout 8 [get_ports {a[38]}]
set_max_transition 0.075 [get_ports {a[38]}]
set_max_capacitance 0.020376 [get_ports {a[38]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[37]}]
set_max_fanout 8 [get_ports {a[37]}]
set_max_transition 0.075 [get_ports {a[37]}]
set_max_capacitance 0.020376 [get_ports {a[37]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[36]}]
set_max_fanout 8 [get_ports {a[36]}]
set_max_transition 0.075 [get_ports {a[36]}]
set_max_capacitance 0.020376 [get_ports {a[36]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[35]}]
set_max_fanout 8 [get_ports {a[35]}]
set_max_transition 0.075 [get_ports {a[35]}]
set_max_capacitance 0.020376 [get_ports {a[35]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[34]}]
set_max_fanout 8 [get_ports {a[34]}]
set_max_transition 0.075 [get_ports {a[34]}]
set_max_capacitance 0.020376 [get_ports {a[34]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[33]}]
set_max_fanout 8 [get_ports {a[33]}]
set_max_transition 0.075 [get_ports {a[33]}]
set_max_capacitance 0.020376 [get_ports {a[33]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[32]}]
set_max_fanout 8 [get_ports {a[32]}]
set_max_transition 0.075 [get_ports {a[32]}]
set_max_capacitance 0.020376 [get_ports {a[32]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[31]}]
set_max_fanout 8 [get_ports {a[31]}]
set_max_transition 0.075 [get_ports {a[31]}]
set_max_capacitance 0.020376 [get_ports {a[31]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[30]}]
set_max_fanout 8 [get_ports {a[30]}]
set_max_transition 0.075 [get_ports {a[30]}]
set_max_capacitance 0.020376 [get_ports {a[30]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[29]}]
set_max_fanout 8 [get_ports {a[29]}]
set_max_transition 0.075 [get_ports {a[29]}]
set_max_capacitance 0.020376 [get_ports {a[29]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[28]}]
set_max_fanout 8 [get_ports {a[28]}]
set_max_transition 0.075 [get_ports {a[28]}]
set_max_capacitance 0.020376 [get_ports {a[28]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[27]}]
set_max_fanout 8 [get_ports {a[27]}]
set_max_transition 0.075 [get_ports {a[27]}]
set_max_capacitance 0.020376 [get_ports {a[27]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[26]}]
set_max_fanout 8 [get_ports {a[26]}]
set_max_transition 0.075 [get_ports {a[26]}]
set_max_capacitance 0.020376 [get_ports {a[26]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[25]}]
set_max_fanout 8 [get_ports {a[25]}]
set_max_transition 0.075 [get_ports {a[25]}]
set_max_capacitance 0.020376 [get_ports {a[25]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[24]}]
set_max_fanout 8 [get_ports {a[24]}]
set_max_transition 0.075 [get_ports {a[24]}]
set_max_capacitance 0.020376 [get_ports {a[24]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[23]}]
set_max_fanout 8 [get_ports {a[23]}]
set_max_transition 0.075 [get_ports {a[23]}]
set_max_capacitance 0.020376 [get_ports {a[23]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[22]}]
set_max_fanout 8 [get_ports {a[22]}]
set_max_transition 0.075 [get_ports {a[22]}]
set_max_capacitance 0.020376 [get_ports {a[22]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[21]}]
set_max_fanout 8 [get_ports {a[21]}]
set_max_transition 0.075 [get_ports {a[21]}]
set_max_capacitance 0.020376 [get_ports {a[21]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[20]}]
set_max_fanout 8 [get_ports {a[20]}]
set_max_transition 0.075 [get_ports {a[20]}]
set_max_capacitance 0.020376 [get_ports {a[20]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[19]}]
set_max_fanout 8 [get_ports {a[19]}]
set_max_transition 0.075 [get_ports {a[19]}]
set_max_capacitance 0.020376 [get_ports {a[19]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[18]}]
set_max_fanout 8 [get_ports {a[18]}]
set_max_transition 0.075 [get_ports {a[18]}]
set_max_capacitance 0.020376 [get_ports {a[18]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[17]}]
set_max_fanout 8 [get_ports {a[17]}]
set_max_transition 0.075 [get_ports {a[17]}]
set_max_capacitance 0.020376 [get_ports {a[17]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[16]}]
set_max_fanout 8 [get_ports {a[16]}]
set_max_transition 0.075 [get_ports {a[16]}]
set_max_capacitance 0.020376 [get_ports {a[16]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[15]}]
set_max_fanout 8 [get_ports {a[15]}]
set_max_transition 0.075 [get_ports {a[15]}]
set_max_capacitance 0.020376 [get_ports {a[15]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[14]}]
set_max_fanout 8 [get_ports {a[14]}]
set_max_transition 0.075 [get_ports {a[14]}]
set_max_capacitance 0.020376 [get_ports {a[14]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[13]}]
set_max_fanout 8 [get_ports {a[13]}]
set_max_transition 0.075 [get_ports {a[13]}]
set_max_capacitance 0.020376 [get_ports {a[13]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[12]}]
set_max_fanout 8 [get_ports {a[12]}]
set_max_transition 0.075 [get_ports {a[12]}]
set_max_capacitance 0.020376 [get_ports {a[12]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[11]}]
set_max_fanout 8 [get_ports {a[11]}]
set_max_transition 0.075 [get_ports {a[11]}]
set_max_capacitance 0.020376 [get_ports {a[11]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[10]}]
set_max_fanout 8 [get_ports {a[10]}]
set_max_transition 0.075 [get_ports {a[10]}]
set_max_capacitance 0.020376 [get_ports {a[10]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[9]}]
set_max_fanout 8 [get_ports {a[9]}]
set_max_transition 0.075 [get_ports {a[9]}]
set_max_capacitance 0.020376 [get_ports {a[9]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[8]}]
set_max_fanout 8 [get_ports {a[8]}]
set_max_transition 0.075 [get_ports {a[8]}]
set_max_capacitance 0.020376 [get_ports {a[8]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[7]}]
set_max_fanout 8 [get_ports {a[7]}]
set_max_transition 0.075 [get_ports {a[7]}]
set_max_capacitance 0.020376 [get_ports {a[7]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[6]}]
set_max_fanout 8 [get_ports {a[6]}]
set_max_transition 0.075 [get_ports {a[6]}]
set_max_capacitance 0.020376 [get_ports {a[6]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[5]}]
set_max_fanout 8 [get_ports {a[5]}]
set_max_transition 0.075 [get_ports {a[5]}]
set_max_capacitance 0.020376 [get_ports {a[5]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[4]}]
set_max_fanout 8 [get_ports {a[4]}]
set_max_transition 0.075 [get_ports {a[4]}]
set_max_capacitance 0.020376 [get_ports {a[4]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[3]}]
set_max_fanout 8 [get_ports {a[3]}]
set_max_transition 0.075 [get_ports {a[3]}]
set_max_capacitance 0.020376 [get_ports {a[3]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[2]}]
set_max_fanout 8 [get_ports {a[2]}]
set_max_transition 0.075 [get_ports {a[2]}]
set_max_capacitance 0.020376 [get_ports {a[2]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[1]}]
set_max_fanout 8 [get_ports {a[1]}]
set_max_transition 0.075 [get_ports {a[1]}]
set_max_capacitance 0.020376 [get_ports {a[1]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {a[0]}]
set_max_fanout 8 [get_ports {a[0]}]
set_max_transition 0.075 [get_ports {a[0]}]
set_max_capacitance 0.020376 [get_ports {a[0]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[63]}]
set_max_fanout 8 [get_ports {b[63]}]
set_max_transition 0.075 [get_ports {b[63]}]
set_max_capacitance 0.020376 [get_ports {b[63]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[62]}]
set_max_fanout 8 [get_ports {b[62]}]
set_max_transition 0.075 [get_ports {b[62]}]
set_max_capacitance 0.020376 [get_ports {b[62]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[61]}]
set_max_fanout 8 [get_ports {b[61]}]
set_max_transition 0.075 [get_ports {b[61]}]
set_max_capacitance 0.020376 [get_ports {b[61]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[60]}]
set_max_fanout 8 [get_ports {b[60]}]
set_max_transition 0.075 [get_ports {b[60]}]
set_max_capacitance 0.020376 [get_ports {b[60]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[59]}]
set_max_fanout 8 [get_ports {b[59]}]
set_max_transition 0.075 [get_ports {b[59]}]
set_max_capacitance 0.020376 [get_ports {b[59]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[58]}]
set_max_fanout 8 [get_ports {b[58]}]
set_max_transition 0.075 [get_ports {b[58]}]
set_max_capacitance 0.020376 [get_ports {b[58]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[57]}]
set_max_fanout 8 [get_ports {b[57]}]
set_max_transition 0.075 [get_ports {b[57]}]
set_max_capacitance 0.020376 [get_ports {b[57]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[56]}]
set_max_fanout 8 [get_ports {b[56]}]
set_max_transition 0.075 [get_ports {b[56]}]
set_max_capacitance 0.020376 [get_ports {b[56]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[55]}]
set_max_fanout 8 [get_ports {b[55]}]
set_max_transition 0.075 [get_ports {b[55]}]
set_max_capacitance 0.020376 [get_ports {b[55]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[54]}]
set_max_fanout 8 [get_ports {b[54]}]
set_max_transition 0.075 [get_ports {b[54]}]
set_max_capacitance 0.020376 [get_ports {b[54]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[53]}]
set_max_fanout 8 [get_ports {b[53]}]
set_max_transition 0.075 [get_ports {b[53]}]
set_max_capacitance 0.020376 [get_ports {b[53]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[52]}]
set_max_fanout 8 [get_ports {b[52]}]
set_max_transition 0.075 [get_ports {b[52]}]
set_max_capacitance 0.020376 [get_ports {b[52]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[51]}]
set_max_fanout 8 [get_ports {b[51]}]
set_max_transition 0.075 [get_ports {b[51]}]
set_max_capacitance 0.020376 [get_ports {b[51]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[50]}]
set_max_fanout 8 [get_ports {b[50]}]
set_max_transition 0.075 [get_ports {b[50]}]
set_max_capacitance 0.020376 [get_ports {b[50]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[49]}]
set_max_fanout 8 [get_ports {b[49]}]
set_max_transition 0.075 [get_ports {b[49]}]
set_max_capacitance 0.020376 [get_ports {b[49]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[48]}]
set_max_fanout 8 [get_ports {b[48]}]
set_max_transition 0.075 [get_ports {b[48]}]
set_max_capacitance 0.020376 [get_ports {b[48]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[47]}]
set_max_fanout 8 [get_ports {b[47]}]
set_max_transition 0.075 [get_ports {b[47]}]
set_max_capacitance 0.020376 [get_ports {b[47]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[46]}]
set_max_fanout 8 [get_ports {b[46]}]
set_max_transition 0.075 [get_ports {b[46]}]
set_max_capacitance 0.020376 [get_ports {b[46]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[45]}]
set_max_fanout 8 [get_ports {b[45]}]
set_max_transition 0.075 [get_ports {b[45]}]
set_max_capacitance 0.020376 [get_ports {b[45]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[44]}]
set_max_fanout 8 [get_ports {b[44]}]
set_max_transition 0.075 [get_ports {b[44]}]
set_max_capacitance 0.020376 [get_ports {b[44]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[43]}]
set_max_fanout 8 [get_ports {b[43]}]
set_max_transition 0.075 [get_ports {b[43]}]
set_max_capacitance 0.020376 [get_ports {b[43]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[42]}]
set_max_fanout 8 [get_ports {b[42]}]
set_max_transition 0.075 [get_ports {b[42]}]
set_max_capacitance 0.020376 [get_ports {b[42]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[41]}]
set_max_fanout 8 [get_ports {b[41]}]
set_max_transition 0.075 [get_ports {b[41]}]
set_max_capacitance 0.020376 [get_ports {b[41]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[40]}]
set_max_fanout 8 [get_ports {b[40]}]
set_max_transition 0.075 [get_ports {b[40]}]
set_max_capacitance 0.020376 [get_ports {b[40]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[39]}]
set_max_fanout 8 [get_ports {b[39]}]
set_max_transition 0.075 [get_ports {b[39]}]
set_max_capacitance 0.020376 [get_ports {b[39]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[38]}]
set_max_fanout 8 [get_ports {b[38]}]
set_max_transition 0.075 [get_ports {b[38]}]
set_max_capacitance 0.020376 [get_ports {b[38]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[37]}]
set_max_fanout 8 [get_ports {b[37]}]
set_max_transition 0.075 [get_ports {b[37]}]
set_max_capacitance 0.020376 [get_ports {b[37]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[36]}]
set_max_fanout 8 [get_ports {b[36]}]
set_max_transition 0.075 [get_ports {b[36]}]
set_max_capacitance 0.020376 [get_ports {b[36]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[35]}]
set_max_fanout 8 [get_ports {b[35]}]
set_max_transition 0.075 [get_ports {b[35]}]
set_max_capacitance 0.020376 [get_ports {b[35]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[34]}]
set_max_fanout 8 [get_ports {b[34]}]
set_max_transition 0.075 [get_ports {b[34]}]
set_max_capacitance 0.020376 [get_ports {b[34]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[33]}]
set_max_fanout 8 [get_ports {b[33]}]
set_max_transition 0.075 [get_ports {b[33]}]
set_max_capacitance 0.020376 [get_ports {b[33]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[32]}]
set_max_fanout 8 [get_ports {b[32]}]
set_max_transition 0.075 [get_ports {b[32]}]
set_max_capacitance 0.020376 [get_ports {b[32]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[31]}]
set_max_fanout 8 [get_ports {b[31]}]
set_max_transition 0.075 [get_ports {b[31]}]
set_max_capacitance 0.020376 [get_ports {b[31]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[30]}]
set_max_fanout 8 [get_ports {b[30]}]
set_max_transition 0.075 [get_ports {b[30]}]
set_max_capacitance 0.020376 [get_ports {b[30]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[29]}]
set_max_fanout 8 [get_ports {b[29]}]
set_max_transition 0.075 [get_ports {b[29]}]
set_max_capacitance 0.020376 [get_ports {b[29]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[28]}]
set_max_fanout 8 [get_ports {b[28]}]
set_max_transition 0.075 [get_ports {b[28]}]
set_max_capacitance 0.020376 [get_ports {b[28]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[27]}]
set_max_fanout 8 [get_ports {b[27]}]
set_max_transition 0.075 [get_ports {b[27]}]
set_max_capacitance 0.020376 [get_ports {b[27]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[26]}]
set_max_fanout 8 [get_ports {b[26]}]
set_max_transition 0.075 [get_ports {b[26]}]
set_max_capacitance 0.020376 [get_ports {b[26]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[25]}]
set_max_fanout 8 [get_ports {b[25]}]
set_max_transition 0.075 [get_ports {b[25]}]
set_max_capacitance 0.020376 [get_ports {b[25]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[24]}]
set_max_fanout 8 [get_ports {b[24]}]
set_max_transition 0.075 [get_ports {b[24]}]
set_max_capacitance 0.020376 [get_ports {b[24]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[23]}]
set_max_fanout 8 [get_ports {b[23]}]
set_max_transition 0.075 [get_ports {b[23]}]
set_max_capacitance 0.020376 [get_ports {b[23]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[22]}]
set_max_fanout 8 [get_ports {b[22]}]
set_max_transition 0.075 [get_ports {b[22]}]
set_max_capacitance 0.020376 [get_ports {b[22]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[21]}]
set_max_fanout 8 [get_ports {b[21]}]
set_max_transition 0.075 [get_ports {b[21]}]
set_max_capacitance 0.020376 [get_ports {b[21]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[20]}]
set_max_fanout 8 [get_ports {b[20]}]
set_max_transition 0.075 [get_ports {b[20]}]
set_max_capacitance 0.020376 [get_ports {b[20]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[19]}]
set_max_fanout 8 [get_ports {b[19]}]
set_max_transition 0.075 [get_ports {b[19]}]
set_max_capacitance 0.020376 [get_ports {b[19]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[18]}]
set_max_fanout 8 [get_ports {b[18]}]
set_max_transition 0.075 [get_ports {b[18]}]
set_max_capacitance 0.020376 [get_ports {b[18]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[17]}]
set_max_fanout 8 [get_ports {b[17]}]
set_max_transition 0.075 [get_ports {b[17]}]
set_max_capacitance 0.020376 [get_ports {b[17]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[16]}]
set_max_fanout 8 [get_ports {b[16]}]
set_max_transition 0.075 [get_ports {b[16]}]
set_max_capacitance 0.020376 [get_ports {b[16]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[15]}]
set_max_fanout 8 [get_ports {b[15]}]
set_max_transition 0.075 [get_ports {b[15]}]
set_max_capacitance 0.020376 [get_ports {b[15]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[14]}]
set_max_fanout 8 [get_ports {b[14]}]
set_max_transition 0.075 [get_ports {b[14]}]
set_max_capacitance 0.020376 [get_ports {b[14]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[13]}]
set_max_fanout 8 [get_ports {b[13]}]
set_max_transition 0.075 [get_ports {b[13]}]
set_max_capacitance 0.020376 [get_ports {b[13]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[12]}]
set_max_fanout 8 [get_ports {b[12]}]
set_max_transition 0.075 [get_ports {b[12]}]
set_max_capacitance 0.020376 [get_ports {b[12]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[11]}]
set_max_fanout 8 [get_ports {b[11]}]
set_max_transition 0.075 [get_ports {b[11]}]
set_max_capacitance 0.020376 [get_ports {b[11]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[10]}]
set_max_fanout 8 [get_ports {b[10]}]
set_max_transition 0.075 [get_ports {b[10]}]
set_max_capacitance 0.020376 [get_ports {b[10]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[9]}]
set_max_fanout 8 [get_ports {b[9]}]
set_max_transition 0.075 [get_ports {b[9]}]
set_max_capacitance 0.020376 [get_ports {b[9]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[8]}]
set_max_fanout 8 [get_ports {b[8]}]
set_max_transition 0.075 [get_ports {b[8]}]
set_max_capacitance 0.020376 [get_ports {b[8]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[7]}]
set_max_fanout 8 [get_ports {b[7]}]
set_max_transition 0.075 [get_ports {b[7]}]
set_max_capacitance 0.020376 [get_ports {b[7]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[6]}]
set_max_fanout 8 [get_ports {b[6]}]
set_max_transition 0.075 [get_ports {b[6]}]
set_max_capacitance 0.020376 [get_ports {b[6]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[5]}]
set_max_fanout 8 [get_ports {b[5]}]
set_max_transition 0.075 [get_ports {b[5]}]
set_max_capacitance 0.020376 [get_ports {b[5]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[4]}]
set_max_fanout 8 [get_ports {b[4]}]
set_max_transition 0.075 [get_ports {b[4]}]
set_max_capacitance 0.020376 [get_ports {b[4]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[3]}]
set_max_fanout 8 [get_ports {b[3]}]
set_max_transition 0.075 [get_ports {b[3]}]
set_max_capacitance 0.020376 [get_ports {b[3]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[2]}]
set_max_fanout 8 [get_ports {b[2]}]
set_max_transition 0.075 [get_ports {b[2]}]
set_max_capacitance 0.020376 [get_ports {b[2]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[1]}]
set_max_fanout 8 [get_ports {b[1]}]
set_max_transition 0.075 [get_ports {b[1]}]
set_max_capacitance 0.020376 [get_ports {b[1]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {b[0]}]
set_max_fanout 8 [get_ports {b[0]}]
set_max_transition 0.075 [get_ports {b[0]}]
set_max_capacitance 0.020376 [get_ports {b[0]}]
set_load -pin_load 0.023433 [get_ports {s[63]}]
set_load -min -pin_load 0.023433 [get_ports {s[63]}]
set_load -pin_load 0.023433 [get_ports {s[62]}]
set_load -min -pin_load 0.023433 [get_ports {s[62]}]
set_load -pin_load 0.023433 [get_ports {s[61]}]
set_load -min -pin_load 0.023433 [get_ports {s[61]}]
set_load -pin_load 0.023433 [get_ports {s[60]}]
set_load -min -pin_load 0.023433 [get_ports {s[60]}]
set_load -pin_load 0.023433 [get_ports {s[59]}]
set_load -min -pin_load 0.023433 [get_ports {s[59]}]
set_load -pin_load 0.023433 [get_ports {s[58]}]
set_load -min -pin_load 0.023433 [get_ports {s[58]}]
set_load -pin_load 0.023433 [get_ports {s[57]}]
set_load -min -pin_load 0.023433 [get_ports {s[57]}]
set_load -pin_load 0.023433 [get_ports {s[56]}]
set_load -min -pin_load 0.023433 [get_ports {s[56]}]
set_load -pin_load 0.023433 [get_ports {s[55]}]
set_load -min -pin_load 0.023433 [get_ports {s[55]}]
set_load -pin_load 0.023433 [get_ports {s[54]}]
set_load -min -pin_load 0.023433 [get_ports {s[54]}]
set_load -pin_load 0.023433 [get_ports {s[53]}]
set_load -min -pin_load 0.023433 [get_ports {s[53]}]
set_load -pin_load 0.023433 [get_ports {s[52]}]
set_load -min -pin_load 0.023433 [get_ports {s[52]}]
set_load -pin_load 0.023433 [get_ports {s[51]}]
set_load -min -pin_load 0.023433 [get_ports {s[51]}]
set_load -pin_load 0.023433 [get_ports {s[50]}]
set_load -min -pin_load 0.023433 [get_ports {s[50]}]
set_load -pin_load 0.023433 [get_ports {s[49]}]
set_load -min -pin_load 0.023433 [get_ports {s[49]}]
set_load -pin_load 0.023433 [get_ports {s[48]}]
set_load -min -pin_load 0.023433 [get_ports {s[48]}]
set_load -pin_load 0.023433 [get_ports {s[47]}]
set_load -min -pin_load 0.023433 [get_ports {s[47]}]
set_load -pin_load 0.023433 [get_ports {s[46]}]
set_load -min -pin_load 0.023433 [get_ports {s[46]}]
set_load -pin_load 0.023433 [get_ports {s[45]}]
set_load -min -pin_load 0.023433 [get_ports {s[45]}]
set_load -pin_load 0.023433 [get_ports {s[44]}]
set_load -min -pin_load 0.023433 [get_ports {s[44]}]
set_load -pin_load 0.023433 [get_ports {s[43]}]
set_load -min -pin_load 0.023433 [get_ports {s[43]}]
set_load -pin_load 0.023433 [get_ports {s[42]}]
set_load -min -pin_load 0.023433 [get_ports {s[42]}]
set_load -pin_load 0.023433 [get_ports {s[41]}]
set_load -min -pin_load 0.023433 [get_ports {s[41]}]
set_load -pin_load 0.023433 [get_ports {s[40]}]
set_load -min -pin_load 0.023433 [get_ports {s[40]}]
set_load -pin_load 0.023433 [get_ports {s[39]}]
set_load -min -pin_load 0.023433 [get_ports {s[39]}]
set_load -pin_load 0.023433 [get_ports {s[38]}]
set_load -min -pin_load 0.023433 [get_ports {s[38]}]
set_load -pin_load 0.023433 [get_ports {s[37]}]
set_load -min -pin_load 0.023433 [get_ports {s[37]}]
set_load -pin_load 0.023433 [get_ports {s[36]}]
set_load -min -pin_load 0.023433 [get_ports {s[36]}]
set_load -pin_load 0.023433 [get_ports {s[35]}]
set_load -min -pin_load 0.023433 [get_ports {s[35]}]
set_load -pin_load 0.023433 [get_ports {s[34]}]
set_load -min -pin_load 0.023433 [get_ports {s[34]}]
set_load -pin_load 0.023433 [get_ports {s[33]}]
set_load -min -pin_load 0.023433 [get_ports {s[33]}]
set_load -pin_load 0.023433 [get_ports {s[32]}]
set_load -min -pin_load 0.023433 [get_ports {s[32]}]
set_load -pin_load 0.023433 [get_ports {s[31]}]
set_load -min -pin_load 0.023433 [get_ports {s[31]}]
set_load -pin_load 0.023433 [get_ports {s[30]}]
set_load -min -pin_load 0.023433 [get_ports {s[30]}]
set_load -pin_load 0.023433 [get_ports {s[29]}]
set_load -min -pin_load 0.023433 [get_ports {s[29]}]
set_load -pin_load 0.023433 [get_ports {s[28]}]
set_load -min -pin_load 0.023433 [get_ports {s[28]}]
set_load -pin_load 0.023433 [get_ports {s[27]}]
set_load -min -pin_load 0.023433 [get_ports {s[27]}]
set_load -pin_load 0.023433 [get_ports {s[26]}]
set_load -min -pin_load 0.023433 [get_ports {s[26]}]
set_load -pin_load 0.023433 [get_ports {s[25]}]
set_load -min -pin_load 0.023433 [get_ports {s[25]}]
set_load -pin_load 0.023433 [get_ports {s[24]}]
set_load -min -pin_load 0.023433 [get_ports {s[24]}]
set_load -pin_load 0.023433 [get_ports {s[23]}]
set_load -min -pin_load 0.023433 [get_ports {s[23]}]
set_load -pin_load 0.023433 [get_ports {s[22]}]
set_load -min -pin_load 0.023433 [get_ports {s[22]}]
set_load -pin_load 0.023433 [get_ports {s[21]}]
set_load -min -pin_load 0.023433 [get_ports {s[21]}]
set_load -pin_load 0.023433 [get_ports {s[20]}]
set_load -min -pin_load 0.023433 [get_ports {s[20]}]
set_load -pin_load 0.023433 [get_ports {s[19]}]
set_load -min -pin_load 0.023433 [get_ports {s[19]}]
set_load -pin_load 0.023433 [get_ports {s[18]}]
set_load -min -pin_load 0.023433 [get_ports {s[18]}]
set_load -pin_load 0.023433 [get_ports {s[17]}]
set_load -min -pin_load 0.023433 [get_ports {s[17]}]
set_load -pin_load 0.023433 [get_ports {s[16]}]
set_load -min -pin_load 0.023433 [get_ports {s[16]}]
set_load -pin_load 0.023433 [get_ports {s[15]}]
set_load -min -pin_load 0.023433 [get_ports {s[15]}]
set_load -pin_load 0.023433 [get_ports {s[14]}]
set_load -min -pin_load 0.023433 [get_ports {s[14]}]
set_load -pin_load 0.023433 [get_ports {s[13]}]
set_load -min -pin_load 0.023433 [get_ports {s[13]}]
set_load -pin_load 0.023433 [get_ports {s[12]}]
set_load -min -pin_load 0.023433 [get_ports {s[12]}]
set_load -pin_load 0.023433 [get_ports {s[11]}]
set_load -min -pin_load 0.023433 [get_ports {s[11]}]
set_load -pin_load 0.023433 [get_ports {s[10]}]
set_load -min -pin_load 0.023433 [get_ports {s[10]}]
set_load -pin_load 0.023433 [get_ports {s[9]}]
set_load -min -pin_load 0.023433 [get_ports {s[9]}]
set_load -pin_load 0.023433 [get_ports {s[8]}]
set_load -min -pin_load 0.023433 [get_ports {s[8]}]
set_load -pin_load 0.023433 [get_ports {s[7]}]
set_load -min -pin_load 0.023433 [get_ports {s[7]}]
set_load -pin_load 0.023433 [get_ports {s[6]}]
set_load -min -pin_load 0.023433 [get_ports {s[6]}]
set_load -pin_load 0.023433 [get_ports {s[5]}]
set_load -min -pin_load 0.023433 [get_ports {s[5]}]
set_load -pin_load 0.023433 [get_ports {s[4]}]
set_load -min -pin_load 0.023433 [get_ports {s[4]}]
set_load -pin_load 0.023433 [get_ports {s[3]}]
set_load -min -pin_load 0.023433 [get_ports {s[3]}]
set_load -pin_load 0.023433 [get_ports {s[2]}]
set_load -min -pin_load 0.023433 [get_ports {s[2]}]
set_load -pin_load 0.023433 [get_ports {s[1]}]
set_load -min -pin_load 0.023433 [get_ports {s[1]}]
set_load -pin_load 0.023433 [get_ports {s[0]}]
set_load -min -pin_load 0.023433 [get_ports {s[0]}]
