#####################################################

#  Created by Design Compiler write_sdc on Sun Apr  5 11:47:55 2009

#####################################################
set sdc_version 1.3

create_clock -name "CLK" -period 2 -waveform {0 1} [get_ports {clk}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[0]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[0]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[1]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[1]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[2]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[2]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[3]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[3]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[4]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[4]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[5]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[5]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[6]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[6]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {di[7]}]
set_input_delay 0 -min -clock "CLK" [get_ports {di[7]}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {wr_n}]
set_input_delay 0 -min -clock "CLK" [get_ports {wr_n}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {rd_n}]
set_input_delay 0 -min -clock "CLK" [get_ports {rd_n}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {clr}]
set_input_delay 0 -min -clock "CLK" [get_ports {clr}]
set_input_delay 0.6 -max -clock "CLK" [get_ports {rst}]
set_input_delay 0 -min -clock "CLK" [get_ports {rst}]
set_output_delay 0.6 [get_ports {empty}]
set_output_delay 0.6 [get_ports {full}]
set_output_delay 0.6 [get_ports {do[0]}]
set_output_delay 0.6 [get_ports {do[1]}]
set_output_delay 0.6 [get_ports {do[2]}]
set_output_delay 0.6 [get_ports {do[3]}]
set_output_delay 0.6 [get_ports {do[4]}]
set_output_delay 0.6 [get_ports {do[5]}]
set_output_delay 0.6 [get_ports {do[6]}]
set_output_delay 0.6 [get_ports {do[7]}]
set_clock_uncertainty  0.2 -setup [get_clocks {CLK}]
set_clock_uncertainty  0.1 -hold [get_clocks {CLK}]
set_max_transition 0.1 [current_design]
set_max_area 0
set_operating_conditions "TCCOM" -library "fsa0a_c_sc_tc"
set_wire_load_model  -name "G5K" -library "fsa0a_c_sc_tc"
set_wire_load_mode "top" 
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {rst}]
set_max_fanout 8 [get_ports {rst}]
set_max_transition 0.1 [get_ports {rst}]
set_max_capacitance 0.020376 [get_ports {rst}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {clr}]
set_max_fanout 8 [get_ports {clr}]
set_max_transition 0.1 [get_ports {clr}]
set_max_capacitance 0.020376 [get_ports {clr}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {rd_n}]
set_max_fanout 8 [get_ports {rd_n}]
set_max_transition 0.1 [get_ports {rd_n}]
set_max_capacitance 0.020376 [get_ports {rd_n}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {wr_n}]
set_max_fanout 8 [get_ports {wr_n}]
set_max_transition 0.1 [get_ports {wr_n}]
set_max_capacitance 0.020376 [get_ports {wr_n}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[7]}]
set_max_fanout 8 [get_ports {di[7]}]
set_max_transition 0.1 [get_ports {di[7]}]
set_max_capacitance 0.020376 [get_ports {di[7]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[6]}]
set_max_fanout 8 [get_ports {di[6]}]
set_max_transition 0.1 [get_ports {di[6]}]
set_max_capacitance 0.020376 [get_ports {di[6]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[5]}]
set_max_fanout 8 [get_ports {di[5]}]
set_max_transition 0.1 [get_ports {di[5]}]
set_max_capacitance 0.020376 [get_ports {di[5]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[4]}]
set_max_fanout 8 [get_ports {di[4]}]
set_max_transition 0.1 [get_ports {di[4]}]
set_max_capacitance 0.020376 [get_ports {di[4]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[3]}]
set_max_fanout 8 [get_ports {di[3]}]
set_max_transition 0.1 [get_ports {di[3]}]
set_max_capacitance 0.020376 [get_ports {di[3]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[2]}]
set_max_fanout 8 [get_ports {di[2]}]
set_max_transition 0.1 [get_ports {di[2]}]
set_max_capacitance 0.020376 [get_ports {di[2]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[1]}]
set_max_fanout 8 [get_ports {di[1]}]
set_max_transition 0.1 [get_ports {di[1]}]
set_max_capacitance 0.020376 [get_ports {di[1]}]
set_driving_cell -lib_cell XMD -library fsa0a_c_io_tc -pin O -no_design_rule [get_ports {di[0]}]
set_max_fanout 8 [get_ports {di[0]}]
set_max_transition 0.1 [get_ports {di[0]}]
set_max_capacitance 0.020376 [get_ports {di[0]}]
set_load -pin_load 0.023433 [get_ports {do[7]}]
set_load -min -pin_load 0.023433 [get_ports {do[7]}]
set_load -pin_load 0.023433 [get_ports {do[6]}]
set_load -min -pin_load 0.023433 [get_ports {do[6]}]
set_load -pin_load 0.023433 [get_ports {do[5]}]
set_load -min -pin_load 0.023433 [get_ports {do[5]}]
set_load -pin_load 0.023433 [get_ports {do[4]}]
set_load -min -pin_load 0.023433 [get_ports {do[4]}]
set_load -pin_load 0.023433 [get_ports {do[3]}]
set_load -min -pin_load 0.023433 [get_ports {do[3]}]
set_load -pin_load 0.023433 [get_ports {do[2]}]
set_load -min -pin_load 0.023433 [get_ports {do[2]}]
set_load -pin_load 0.023433 [get_ports {do[1]}]
set_load -min -pin_load 0.023433 [get_ports {do[1]}]
set_load -pin_load 0.023433 [get_ports {do[0]}]
set_load -min -pin_load 0.023433 [get_ports {do[0]}]
set_load -pin_load 0.023433 [get_ports {full}]
set_load -min -pin_load 0.023433 [get_ports {full}]
set_load -pin_load 0.023433 [get_ports {empty}]
set_load -min -pin_load 0.023433 [get_ports {empty}]
